; domain
(define (domain put_task)
 (:requirements :typing :adl)
 (:types
    agent - dummy
    receptacle - dummy
    object -dummy
    receptacle_object - receptacle
    receptacle_object - object
  )

 (:predicates
    (atLocation ?a - agent ?l - receptacle)
    (objectAtLocation ?o - object ?l - receptacle)
    (inReceptacle ?o - object ?r - receptacle)
    (isReceptacleObject ?o - object)
    (holds ?a - agent ?o - object)
    (holdsAny ?a - agent)
    (holdsAnyReceptacleObject ?a - agent)
    (isClean ?o - object)
    (cleanable ?o - object)
    (isHot ?o - object)
    (heatable ?o - object)
    (isCool ?o - object)
    (coolable ?o - object)
    (toggleable ?o - object)
    (isOn ?o - object)
    (isToggled ?o - object)
    (sliceable ?o - object)
    (isSliced ?o - object)
    (isSinkBasin ?r - receptacle)
    (isMicrowave ?r - receptacle)
    (isFridge ?r - receptacle)
    (isKnife ?o - object)
    (isCounterTop ?o - object)
 )

 (:action GotoLocation
    :parameters (?a - agent ?lStart - receptacle ?lEnd - receptacle)
    :precondition (and
            (atLocation ?a ?lStart)
            )
    :effect (and
                (atLocation ?a ?lEnd)
                (not (atLocation ?a ?lStart))
            )
 )



 (:action PickupObjectInReceptacle
    :parameters (?a - agent ?o - object ?r - receptacle)
    :precondition (and
            (atLocation ?a ?r)
            (objectAtLocation ?o ?r)
            (inReceptacle ?o ?r)
            (not (holdsAny ?a))
            )
    :effect (and
                (not (inReceptacle ?o ?r))
                (not (objectAtLocation ?o ?r))
                (holds ?a ?o)
                (holdsAny ?a)
            )
 )

 (:action PickupObjectNoReceptacle
    :parameters (?a - agent ?o - object ?r - receptacle)
    :precondition (and
            (atLocation ?a ?r)
            (objectAtLocation ?o ?r)
            (not (inReceptacle ?o ?r))
            (not (holdsAny ?a))
            )
    :effect (and
                (not (objectAtLocation ?o ?r))
                (holds ?a ?o)
                (holdsAny ?a)
            )
 )

 (:action PutObjectInReceptacle
    :parameters (?a - agent ?o - object ?r - receptacle)
    :precondition (and
            (atLocation ?a ?r)
            (holds ?a ?o)
            (not (holdsAnyReceptacleObject ?a))
            )
    :effect (and
                (inReceptacle ?o ?r)
                (not (holds ?a ?o))
                (not (holdsAny ?a))
                (objectAtLocation ?o ?r)
            )
 )

 (:action PutObjectInReceptacleObject
    :parameters (?a - agent ?o - object ?outerO ?outerR - receptacle)
    :precondition (and
            (atLocation ?a ?outerR)
            (objectAtLocation ?outerO ?outerR)
            (isReceptacleObject ?outerO)
            (not (isReceptacleObject ?o))
            (holds ?a ?o)
            (not (holdsAnyReceptacleObject ?a))
            (inReceptacle ?outerO ?outerR)
            )
    :effect (and
                (inReceptacle ?o ?outerO)
                (inReceptacle ?o ?outerR)
                (not (holds ?a ?o))
                (not (holdsAny ?a))
                (objectAtLocation ?o ?outerR)
            )
 )

 (:action PutReceptacleObjectInReceptacle
    :parameters (?a - agent ?outerO - object ?r - receptacle)
    :precondition (and
            (atLocation ?a ?r)
            (holds ?a ?outerO)
            (holdsAnyReceptacleObject ?a)
            (isReceptacleObject ?outerO)
            )
    :effect (and
                (forall (?obj - object)
                    (when (holds ?a ?obj)
                        (and
                            (not (holds ?a ?obj))
                            (objectAtLocation ?obj ?r)
                            (inReceptacle ?obj ?r)
                        )
                    )
                )
                (not (holdsAny ?a))
                (not (holdsAnyReceptacleObject ?a))
            )
 )

 (:action CleanObject
    :parameters (?a - agent ?o - object ?l - receptacle)
    :precondition (and
            (isSinkBasin ?l)
            (atLocation ?a ?l)
            (holds ?a ?o)
            )
    :effect (and
                (isClean ?o)
            )
 )

 (:action HeatObject
    :parameters (?a - agent ?o - object ?l - receptacle)
    :precondition (and
            (or
                (isMicrowave ?l)
            )
            (atLocation ?a ?l)
            (holds ?a ?o)
            )
    :effect (and
                (isHot ?o)
            )
 )

 (:action CoolObject
    :parameters (?a - agent ?o - object ?l - receptacle)
    :precondition (and
            (or
                (isFridge ?l)
            )
            (atLocation ?a ?l)
            (holds ?a ?o)
            )
    :effect (and
                (isCool ?o)
            )
 )

 (:action ToggleObject
    :parameters (?a - agent ?o - object ?l - receptacle)
    :precondition (and
            (atLocation ?a ?l)
            (objectAtLocation ?o ?l)
            (toggleable ?o)
            )
    :effect (and
                (when (isOn ?o)
                    (not (isOn ?o)))
                (when (not (isOn ?o))
                    (isOn ?o))
                (isToggled ?o)
            )
 )

 (:action SliceObject
    :parameters (?a - agent ?co - object ?ko - object ?l - receptacle)
    :precondition
            (and
                (isKnife ?ko)
                (atLocation ?a ?l)
                (objectAtLocation ?co ?l)
                (sliceable ?co)
                (holds ?a ?ko)
                (isCounterTop ?l)
            )
    :effect (and
                (isSliced ?co)
            )
 )
)

; problem
(define (problem move_Book1_to_Box2_with_three_object_38)
  (:domain put_task)
  (:objects
    agent1 - agent
    Laptop1 - object
    Book2 - object
    Book1 - object
    Watch1 - object
    CreditCard1 - object
    Pencil1 - object
    Watch2 - object
    CellPhone1 - object
    Pen2 - object
    Pen1 - object
    Book3 - object
    Drawer1 - receptacle
    Bed1 - receptacle
    Box2 - receptacle
    Desk2 - receptacle
    Sofa1 - receptacle
    Box1 - receptacle
    Desk1 - receptacle
    Drawer3 - receptacle
    Bed2 - receptacle
    Box3 - receptacle
    Drawer2 - receptacle
    Pencil2 - object
    Pencil3 - object
    Pencil4 - object
    Pencil5 - object
    Pencil6 - object
    Laptop2 - object
    Sofa2 - receptacle
  )

  (:init
    (atLocation agent1 Sofa1)
    (objectAtLocation Book1 Bed1)
    (objectAtLocation Book2 Sofa1)
    (objectAtLocation Watch1 Drawer1)
    (objectAtLocation Laptop1 Bed2)
    (objectAtLocation Watch2 Desk1)
    (objectAtLocation CellPhone1 Desk2)
    (objectAtLocation Pen2 Drawer2)
    (objectAtLocation Book3 Drawer3)
    (objectAtLocation Laptop2 Box1)
    (objectAtLocation Pencil4 Box3)
    (objectAtLocation Pencil2 Box2)
    (objectAtLocation Pencil1 Box1)
    (objectAtLocation Pencil5 Box2)
    (objectAtLocation Pencil3 Box2)
    (objectAtLocation Pencil6 Box1)
  )

  (:goal
    (and
      (objectAtLocation Book1 Box2)
    )
  )
)

; plan
1. (gotolocation agent1 sofa1 bed1)
   deleted: (atlocation agent1 sofa1)
   added: (atlocation agent1 bed1)
   goals met: 0 of 1
2. (pickupobjectnoreceptacle agent1 book1 bed1)
   deleted: (objectatlocation book1 bed1)
   added: (holds agent1 book1) (holdsany agent1)
   goals met: 0 of 1
3. (gotolocation agent1 bed1 box2)
   deleted: (atlocation agent1 bed1)
   added: (atlocation agent1 box2)
   goals met: 0 of 1
4. (putobjectinreceptacle agent1 book1 box2)
   deleted: (holds agent1 book1) (holdsany agent1)
   added: (inreceptacle book1 box2) (objectatlocation book1 box2)
   goals met: 1 of 1
